view all legacy authentication events:

SecurityEvent
| where EventID == 4624 and TargetLogonId != 0x0  
| extend LegacyAuthentication = iif((LogonProcessName =~ "Advapi" or LogonProcessName =~ "Ssp"), "True", "False")  
| where LegacyAuthentication == "True"  
