//View all legacy authentication events from a specific source IP address

SecurityEvent  
| where EventID == 4624 and TargetLogonId != 0x0 and IpAddress == "<source IP address>"  
| extend LegacyAuthentication = iif((LogonProcessName =~ "Advapi" or LogonProcessName =~ "Ssp"), "True", "False")  
| where LegacyAuthentication == "True"
